------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\repos\stata-rcallcountrycode\benchmark\benchmark.log
  log type:  text
 opened on:  18 Feb 2019, 21:56:53

. 
. which kountry
c:\ado\plus\k\kountry.ado
*! version 2.1.6  12aug2013

. 
. * list of countries from https://gist.github.com/kalinchernev/486393efcca01623b18d
. import delimited list_of_countries.csv, clear varnames(1)
(1 var, 196 obs)

. save list_of_countries, replace
file list_of_countries.dta saved

. 
. timer clear

. 
. * doing with a list of countries, each country once, 196 observations
. describe, short

Contains data from list_of_countries.dta
  obs:           196                          
 vars:             1                          18 Feb 2019 21:56
 size:         5,880                          
Sorted by: 

. timeit 1: qui rcallcountrycode country, from(country.name.en) to(country.name.en) gen(r_name) marker

. timeit 2: qui kountry country, from(other) marker
NAMES_STD MARKER
. timer list
   1:      4.09 /        1 =       4.0870
   2:      0.02 /        1 =       0.0160

. 
. * compare results. lowercase is rcallcountrycode; uppercase is kountry
. tab marker MARKER

           |        MARKER
    marker |         0          1 |     Total
-----------+----------------------+----------
         0 |         1          1 |         2 
         1 |         5        189 |       194 
-----------+----------------------+----------
     Total |         6        190 |       196 


. 
. * now with the same list, duplicated many times, as in a large dataset
. * 392k rows with 196 countries. with gtools and ftools installed
. clear

. forvalues k = 1/2000 {
  2.         append using list_of_countries
  3. }

. 
. * compare results
. describe, short

Contains data
  obs:       392,000                          
 vars:             1                          
 size:    11,760,000                          
Sorted by: 
     Note: Dataset has changed since last saved.

. timeit 3: qui rcallcountrycode country, from(country.name.en) to(country.name.en) gen(r_name) marker

. timeit 4: qui kountry country, from(other) marker
NAMES_STD MARKER
. timer list
   1:      4.09 /        1 =       4.0870
   2:      0.02 /        1 =       0.0160
   3:      4.54 /        1 =       4.5400
   4:     17.88 /        1 =      17.8780

. 
. * Compare relative performances as dataset increases 2000 times:
. di "rcallcountrycode's time of execution increased by a relative factor of"
rcallcountrycode's time of execution increased by a relative factor of

. di r(t3)/r(t1) - 1
.11083925

. di "rcallcountrycode's time of execution increased by a relative factor of"
rcallcountrycode's time of execution increased by a relative factor of

. di r(t4)/r(t2) - 1
1116.375

. 
. log close
      name:  <unnamed>
       log:  D:\repos\stata-rcallcountrycode\benchmark\benchmark.log
  log type:  text
 closed on:  18 Feb 2019, 21:57:21
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
